Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_TRDC.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Enumeration for trdc master 2 mapping
 * Defines the enumeration for trdc master 2 resource collections.
 */
typedef enum _trdc2_master
{
    kTRDC2_MasterCM7AHBP            = 0U,          /**< CM7 AHBP */
    kTRDC2_MasterCM7AXI             = 1U,          /**< CM7 AXI */
    kTRDC2_MasterDAP                = 2U,          /**< DAP AHB_AP_SYS */
    kTRDC2_MasterCoreSight          = 3U,          /**< CoreSight */
    kTRDC2_MasterDMA4               = 4U,          /**< DMA4 */
    kTRDC2_MasterNETC               = 5U,          /**< NETC */
} trdc2_master_t;

/* @} */
#endif /* TRDC2_MASTER_T_ */

#if !defined(TRDC3_MASTER_T_)
#define TRDC3_MASTER_T_
/*!
 * @addtogroup trdc3_master_mapping
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Enumeration for trdc master 3 mapping
 * Defines the enumeration for trdc master 3 resource collections.
 */
typedef enum _trdc3_master
{
    kTRDC3_MasterUSDHC1             = 0U,          /**< uSDHC1 */
    kTRDC3_MasterUSDHC2             = 1U,          /**< uSDHC2 */
    kTRDC3_MasterReserved0          = 2U,          /**< Reserved0 */
    kTRDC3_MasterUsb                = 3U,          /**< USB */
    kTRDC3_MasterFlexspiFlr         = 4U,          /**< FlexSPI_FLR */
} trdc3_master_t;

/* @} */
#endif /* TRDC3_MASTER_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- TRDC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRDC_Peripheral_Access_Layer TRDC Peripheral Access Layer
 * @{
 */

/** TRDC - Size of Registers Arrays */
#define TRDC_DACFG_COUNT                          6u
#define TRDC_DERRLOC_COUNT                        16u
#define TRDC_MBC_DERR_COUNT                       2u
#define TRDC_MRC_DERR_COUNT                       7u
#define TRDC_PID_COUNT                            2u
#define TRDC_MDA_W_DFMT_DFMT0_MDA_DFMT0_MDA_Wx_DFMT0_COUNT 7u
#define TRDC_MDA_W_DFMT_DFMT0_MDA_DFMT0_COUNT     6u
#define TRDC_MDA_W_DFMT_DFMT1_MDA_DFMT1_MDA_Wx_DFMT1_COUNT 1u
#define TRDC_MDA_W_DFMT_DFMT1_MDA_DFMT1_COUNT     5u
#define TRDC_MBC_INDEX_MBC_MEM_GLBCFG_COUNT       4u
#define TRDC_MBC_INDEX_MBC_MEMN_GLBAC_COUNT       8u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM0_BLK_CFG_W_COUNT 16u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM0_BLK_NSE_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM1_BLK_CFG_W_COUNT 4u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM1_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM2_BLK_CFG_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM2_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM3_BLK_CFG_W_COUNT 3u
#define TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM3_BLK_NSE_W_COUNT 1u
#define TRDC_MBC_INDEX_COUNT                      2u
#define TRDC_MRC_INDEX_MRC_GLBAC_COUNT            8u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM0_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM0_RGD_MRC_INDEX_DOM0_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM1_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM1_RGD_MRC_INDEX_DOM1_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM2_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM2_RGD_MRC_INDEX_DOM2_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM3_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM3_RGD_MRC_INDEX_DOM3_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM4_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM4_RGD_MRC_INDEX_DOM4_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM5_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM5_RGD_MRC_INDEX_DOM5_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM6_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM6_RGD_MRC_INDEX_DOM6_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM7_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM7_RGD_MRC_INDEX_DOM7_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM8_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM8_RGD_MRC_INDEX_DOM8_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM9_RGD_COUNT   16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM9_RGD_MRC_INDEX_DOM9_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM10_RGD_COUNT  16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM10_RGD_MRC_INDEX_DOM10_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM11_RGD_COUNT  16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM11_RGD_MRC_INDEX_DOM11_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM12_RGD_COUNT  16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM12_RGD_MRC_INDEX_DOM12_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM13_RGD_COUNT  16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM13_RGD_MRC_INDEX_DOM13_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM14_RGD_COUNT  16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM14_RGD_MRC_INDEX_DOM14_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM15_RGD_COUNT  16u
#define TRDC_MRC_INDEX_MRC_INDEX_DOM15_RGD_MRC_INDEX_DOM15_RGD_W_COUNT 2u
#define TRDC_MRC_INDEX_COUNT                      7u

