Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_TRDC.h
/** TRDC - Register Layout Typedef */
typedef struct {
  __IO uint32_t TRDC_CR;                           /**< TRDC Register, offset: 0x0 */
       uint8_t RESERVED_0[236];
  __I  uint32_t TRDC_HWCFG0;                       /**< TRDC Hardware Configuration Register 0, offset: 0xF0 */
  __I  uint32_t TRDC_HWCFG1;                       /**< TRDC Hardware Configuration Register 1, offset: 0xF4 */
  __I  uint32_t TRDC_HWCFG2;                       /**< TRDC Hardware Configuration Register 2, offset: 0xF8 */
  __I  uint32_t TRDC_HWCFG3;                       /**< TRDC Hardware Configuration Register 3, offset: 0xFC */
  __I  uint8_t DACFG[TRDC_DACFG_COUNT];            /**< Domain Assignment Configuration Register, array offset: 0x100, array step: 0x1, irregular array, not all indices are valid */
       uint8_t RESERVED_1[186];
  __IO uint32_t TRDC_IDAU_CR;                      /**< TRDC IDAU Control Register, offset: 0x1C0 */
       uint8_t RESERVED_2[28];
  __IO uint32_t TRDC_FLW_CTL;                      /**< TRDC FLW Control, offset: 0x1E0 */
  __I  uint32_t TRDC_FLW_PBASE;                    /**< TRDC FLW Physical Base, offset: 0x1E4 */
  __IO uint32_t TRDC_FLW_ABASE;                    /**< TRDC FLW Array Base, offset: 0x1E8 */
  __IO uint32_t TRDC_FLW_BCNT;                     /**< TRDC FLW Block Count, offset: 0x1EC */
       uint8_t RESERVED_3[12];
  __IO uint32_t TRDC_FDID;                         /**< TRDC Fault Domain ID, offset: 0x1FC */
  __I  uint32_t TRDC_DERRLOC[TRDC_DERRLOC_COUNT];  /**< TRDC Domain Error Location Register, array offset: 0x200, array step: 0x4 */
       uint8_t RESERVED_4[448];
  struct {                                         /* offset: 0x400, array step: 0x10 */
    __I  uint32_t W0;                                /**< MBC Domain Error Word0 Register, array offset: 0x400, array step: 0x10, available only on: TRDC1, TRDC2 (missing on TRDC3) */
    __I  uint32_t W1;                                /**< MBC Domain Error Word1 Register, array offset: 0x404, array step: 0x10, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_0[4];
    __IO uint32_t W3;                                /**< MBC Domain Error Word3 Register, array offset: 0x40C, array step: 0x10, available only on: TRDC1, TRDC2 (missing on TRDC3) */
  } MBC_DERR[TRDC_MBC_DERR_COUNT];
       uint8_t RESERVED_5[96];
  struct {                                         /* offset: 0x480, array step: 0x10 */
    __I  uint32_t W0;                                /**< MRC Domain Error Word0 Register, array offset: 0x480, array step: 0x10, irregular array, not all indices are valid */
    __I  uint32_t W1;                                /**< MRC Domain Error Word1 Register, array offset: 0x484, array step: 0x10, irregular array, not all indices are valid */
         uint8_t RESERVED_0[4];
    __IO uint32_t W3;                                /**< MRC Domain Error Word3 Register, array offset: 0x48C, array step: 0x10, irregular array, not all indices are valid */
  } MRC_DERR[TRDC_MRC_DERR_COUNT];
       uint8_t RESERVED_6[528];
  __IO uint32_t PID[TRDC_PID_COUNT];               /**< Process Identifier, array offset: 0x700, array step: 0x4, available only on: TRDC1 (missing on TRDC2, TRDC3) */
       uint8_t RESERVED_7[248];
  union {                                          /* offset: 0x800 */
    struct {                                         /* offset: 0x800, array step: 0x20 */
      __IO uint32_t MDA_W_DFMT0[TRDC_MDA_W_DFMT_DFMT0_MDA_DFMT0_MDA_Wx_DFMT0_COUNT];     /**< DAC Master Domain Assignment Register, array offset: 0x800, array step: index*0x20, index2*0x4, irregular array, not all indices are valid */
           uint8_t RESERVED_0[4];
    } MDA_DFMT0[TRDC_MDA_W_DFMT_DFMT0_MDA_DFMT0_COUNT];
    struct {                                         /* offset: 0x800, array step: 0x20 */
      __IO uint32_t MDA_W_DFMT1[TRDC_MDA_W_DFMT_DFMT1_MDA_DFMT1_MDA_Wx_DFMT1_COUNT];     /**< DAC Master Domain Assignment Register, array offset: 0x800, array step: index*0x20, index2*0x4, irregular array, not all indices are valid */
           uint8_t RESERVED_0[28];
    } MDA_DFMT1[TRDC_MDA_W_DFMT_DFMT1_MDA_DFMT1_COUNT];
  };
       uint8_t RESERVED_8[63296];
  struct {                                         /* offset: 0x10000, array step: 0x2000 */
    __I  uint32_t MBC_MEM_GLBCFG[TRDC_MBC_INDEX_MBC_MEM_GLBCFG_COUNT];   /**< MBC Global Configuration Register, array offset: 0x10000, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
    __IO uint32_t MBC_NSE_BLK_INDEX;                 /**< MBC NonSecure Enable Block Index, array offset: 0x10010, array step: 0x2000, available only on: TRDC1, TRDC2 (missing on TRDC3) */
    __IO uint32_t MBC_NSE_BLK_SET;                   /**< MBC NonSecure Enable Block Set, array offset: 0x10014, array step: 0x2000, available only on: TRDC1, TRDC2 (missing on TRDC3) */
    __IO uint32_t MBC_NSE_BLK_CLR;                   /**< MBC NonSecure Enable Block Clear, array offset: 0x10018, array step: 0x2000, available only on: TRDC1, TRDC2 (missing on TRDC3) */
    __IO uint32_t MBC_NSE_BLK_CLR_ALL;               /**< MBC NonSecure Enable Block Clear All, array offset: 0x1001C, array step: 0x2000, available only on: TRDC1, TRDC2 (missing on TRDC3) */
    __IO uint32_t MBC_MEMN_GLBAC[TRDC_MBC_INDEX_MBC_MEMN_GLBAC_COUNT];   /**< MBC Global Access Control, array offset: 0x10020, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
    __IO uint32_t MBC_DOM0_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10040, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_0[192];
    __IO uint32_t MBC_DOM0_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10140, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_1[48];
    __IO uint32_t MBC_DOM0_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10180, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_2[16];
    __IO uint32_t MBC_DOM0_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x101A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_3[4];
    __IO uint32_t MBC_DOM0_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x101A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_4[28];
    __IO uint32_t MBC_DOM0_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x101C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_5[4];
    __IO uint32_t MBC_DOM0_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x101D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_6[20];
    __IO uint32_t MBC_DOM0_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM0_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x101F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_7[76];
    __IO uint32_t MBC_DOM1_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10240, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_8[192];
    __IO uint32_t MBC_DOM1_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10340, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_9[48];
    __IO uint32_t MBC_DOM1_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10380, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_10[16];
    __IO uint32_t MBC_DOM1_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x103A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_11[4];
    __IO uint32_t MBC_DOM1_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x103A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_12[28];
    __IO uint32_t MBC_DOM1_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x103C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_13[4];
    __IO uint32_t MBC_DOM1_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x103D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_14[20];
    __IO uint32_t MBC_DOM1_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM1_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x103F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_15[76];
    __IO uint32_t MBC_DOM2_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10440, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_16[192];
    __IO uint32_t MBC_DOM2_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10540, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_17[48];
    __IO uint32_t MBC_DOM2_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10580, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_18[16];
    __IO uint32_t MBC_DOM2_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x105A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_19[4];
    __IO uint32_t MBC_DOM2_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x105A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_20[28];
    __IO uint32_t MBC_DOM2_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x105C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_21[4];
    __IO uint32_t MBC_DOM2_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x105D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_22[20];
    __IO uint32_t MBC_DOM2_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM2_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x105F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_23[76];
    __IO uint32_t MBC_DOM3_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10640, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_24[192];
    __IO uint32_t MBC_DOM3_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10740, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_25[48];
    __IO uint32_t MBC_DOM3_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10780, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_26[16];
    __IO uint32_t MBC_DOM3_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x107A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_27[4];
    __IO uint32_t MBC_DOM3_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x107A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_28[28];
    __IO uint32_t MBC_DOM3_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x107C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_29[4];
    __IO uint32_t MBC_DOM3_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x107D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_30[20];
    __IO uint32_t MBC_DOM3_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM3_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x107F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_31[76];
    __IO uint32_t MBC_DOM4_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10840, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_32[192];
    __IO uint32_t MBC_DOM4_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10940, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_33[48];
    __IO uint32_t MBC_DOM4_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10980, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_34[16];
    __IO uint32_t MBC_DOM4_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x109A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_35[4];
    __IO uint32_t MBC_DOM4_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x109A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_36[28];
    __IO uint32_t MBC_DOM4_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x109C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_37[4];
    __IO uint32_t MBC_DOM4_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x109D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_38[20];
    __IO uint32_t MBC_DOM4_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM4_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x109F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_39[76];
    __IO uint32_t MBC_DOM5_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10A40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_40[192];
    __IO uint32_t MBC_DOM5_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10B40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_41[48];
    __IO uint32_t MBC_DOM5_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10B80, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_42[16];
    __IO uint32_t MBC_DOM5_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10BA0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_43[4];
    __IO uint32_t MBC_DOM5_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10BA8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_44[28];
    __IO uint32_t MBC_DOM5_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10BC8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_45[4];
    __IO uint32_t MBC_DOM5_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10BD0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_46[20];
    __IO uint32_t MBC_DOM5_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM5_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10BF0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_47[76];
    __IO uint32_t MBC_DOM6_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10C40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_48[192];
    __IO uint32_t MBC_DOM6_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10D40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_49[48];
    __IO uint32_t MBC_DOM6_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10D80, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_50[16];
    __IO uint32_t MBC_DOM6_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10DA0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_51[4];
    __IO uint32_t MBC_DOM6_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10DA8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_52[28];
    __IO uint32_t MBC_DOM6_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10DC8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_53[4];
    __IO uint32_t MBC_DOM6_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10DD0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_54[20];
    __IO uint32_t MBC_DOM6_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM6_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10DF0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_55[76];
    __IO uint32_t MBC_DOM7_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10E40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_56[192];
    __IO uint32_t MBC_DOM7_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10F40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_57[48];
    __IO uint32_t MBC_DOM7_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10F80, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_58[16];
    __IO uint32_t MBC_DOM7_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10FA0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_59[4];
    __IO uint32_t MBC_DOM7_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10FA8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_60[28];
    __IO uint32_t MBC_DOM7_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10FC8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_61[4];
    __IO uint32_t MBC_DOM7_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x10FD0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_62[20];
    __IO uint32_t MBC_DOM7_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM7_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x10FF0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_63[76];
    __IO uint32_t MBC_DOM8_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11040, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_64[192];
