Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_TRDC.h
    __IO uint32_t MBC_DOM8_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11140, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_65[48];
    __IO uint32_t MBC_DOM8_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11180, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_66[16];
    __IO uint32_t MBC_DOM8_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x111A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_67[4];
    __IO uint32_t MBC_DOM8_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x111A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_68[28];
    __IO uint32_t MBC_DOM8_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x111C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_69[4];
    __IO uint32_t MBC_DOM8_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x111D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_70[20];
    __IO uint32_t MBC_DOM8_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM8_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x111F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_71[76];
    __IO uint32_t MBC_DOM9_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11240, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_72[192];
    __IO uint32_t MBC_DOM9_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11340, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_73[48];
    __IO uint32_t MBC_DOM9_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11380, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_74[16];
    __IO uint32_t MBC_DOM9_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x113A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_75[4];
    __IO uint32_t MBC_DOM9_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x113A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_76[28];
    __IO uint32_t MBC_DOM9_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x113C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_77[4];
    __IO uint32_t MBC_DOM9_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x113D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_78[20];
    __IO uint32_t MBC_DOM9_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM9_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x113F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_79[76];
    __IO uint32_t MBC_DOM10_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11440, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_80[192];
    __IO uint32_t MBC_DOM10_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11540, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_81[48];
    __IO uint32_t MBC_DOM10_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11580, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_82[16];
    __IO uint32_t MBC_DOM10_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x115A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_83[4];
    __IO uint32_t MBC_DOM10_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x115A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_84[28];
    __IO uint32_t MBC_DOM10_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x115C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_85[4];
    __IO uint32_t MBC_DOM10_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x115D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_86[20];
    __IO uint32_t MBC_DOM10_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM10_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x115F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_87[76];
    __IO uint32_t MBC_DOM11_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11640, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_88[192];
    __IO uint32_t MBC_DOM11_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11740, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_89[48];
    __IO uint32_t MBC_DOM11_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11780, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_90[16];
    __IO uint32_t MBC_DOM11_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x117A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_91[4];
    __IO uint32_t MBC_DOM11_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x117A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_92[28];
    __IO uint32_t MBC_DOM11_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x117C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_93[4];
    __IO uint32_t MBC_DOM11_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x117D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_94[20];
    __IO uint32_t MBC_DOM11_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM11_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x117F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_95[76];
    __IO uint32_t MBC_DOM12_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11840, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_96[192];
    __IO uint32_t MBC_DOM12_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11940, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_97[48];
    __IO uint32_t MBC_DOM12_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11980, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_98[16];
    __IO uint32_t MBC_DOM12_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x119A0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_99[4];
    __IO uint32_t MBC_DOM12_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x119A8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_100[28];
    __IO uint32_t MBC_DOM12_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x119C8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_101[4];
    __IO uint32_t MBC_DOM12_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x119D0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_102[20];
    __IO uint32_t MBC_DOM12_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM12_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x119F0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_103[76];
    __IO uint32_t MBC_DOM13_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11A40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_104[192];
    __IO uint32_t MBC_DOM13_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11B40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_105[48];
    __IO uint32_t MBC_DOM13_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11B80, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_106[16];
    __IO uint32_t MBC_DOM13_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11BA0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_107[4];
    __IO uint32_t MBC_DOM13_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11BA8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_108[28];
    __IO uint32_t MBC_DOM13_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11BC8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_109[4];
    __IO uint32_t MBC_DOM13_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11BD0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_110[20];
    __IO uint32_t MBC_DOM13_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM13_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11BF0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_111[76];
    __IO uint32_t MBC_DOM14_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11C40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_112[192];
    __IO uint32_t MBC_DOM14_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11D40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_113[48];
    __IO uint32_t MBC_DOM14_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11D80, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_114[16];
    __IO uint32_t MBC_DOM14_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11DA0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_115[4];
    __IO uint32_t MBC_DOM14_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11DA8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_116[28];
    __IO uint32_t MBC_DOM14_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11DC8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_117[4];
    __IO uint32_t MBC_DOM14_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11DD0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_118[20];
    __IO uint32_t MBC_DOM14_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM14_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11DF0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_119[76];
    __IO uint32_t MBC_DOM15_MEM0_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM0_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11E40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_120[192];
    __IO uint32_t MBC_DOM15_MEM0_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM0_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11F40, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_121[48];
    __IO uint32_t MBC_DOM15_MEM1_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM1_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11F80, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_122[16];
    __IO uint32_t MBC_DOM15_MEM1_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM1_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11FA0, array step: index*0x2000, index2*0x4, available only on: TRDC1, TRDC2 (missing on TRDC3) */
         uint8_t RESERVED_123[4];
    __IO uint32_t MBC_DOM15_MEM2_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM2_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11FA8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_124[28];
    __IO uint32_t MBC_DOM15_MEM2_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM2_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11FC8, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_125[4];
    __IO uint32_t MBC_DOM15_MEM3_BLK_CFG_W[TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM3_BLK_CFG_W_COUNT];   /**< MBC Memory Block Configuration Word, array offset: 0x11FD0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_126[20];
    __IO uint32_t MBC_DOM15_MEM3_BLK_NSE_W[TRDC_MBC_INDEX_MBC_INDEX_DOM15_MEM3_BLK_NSE_W_COUNT];   /**< MBC Memory Block NonSecure Enable Word, array offset: 0x11FF0, array step: index*0x2000, index2*0x4, irregular array, not all indices are valid */
         uint8_t RESERVED_127[12];
  } MBC_INDEX[TRDC_MBC_INDEX_COUNT];
  struct {                                         /* offset: 0x14000, array step: 0x1000 */
    __I  uint32_t MRC_GLBCFG;                        /**< MRC Global Configuration Register, array offset: 0x14000, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_0[12];
    __IO uint32_t MRC_NSE_RGN_INDIRECT;              /**< MRC NonSecure Enable Region Indirect, array offset: 0x14010, array step: 0x1000, irregular array, not all indices are valid */
    __IO uint32_t MRC_NSE_RGN_SET;                   /**< MRC NonSecure Enable Region Set, array offset: 0x14014, array step: 0x1000, irregular array, not all indices are valid */
    __IO uint32_t MRC_NSE_RGN_CLR;                   /**< MRC NonSecure Enable Region Clear, array offset: 0x14018, array step: 0x1000, irregular array, not all indices are valid */
    __IO uint32_t MRC_NSE_RGN_CLR_ALL;               /**< MRC NonSecure Enable Region Clear All, array offset: 0x1401C, array step: 0x1000, irregular array, not all indices are valid */
    __IO uint32_t MRC_GLBAC[TRDC_MRC_INDEX_MRC_GLBAC_COUNT];   /**< MRC Global Access Control, array offset: 0x14020, array step: index*0x1000, index2*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM0_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM0_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM0_RGD_MRC_INDEX_DOM0_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14040, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM0_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x140C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_1[124];
    __IO uint32_t MRC_DOM1_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM1_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM1_RGD_MRC_INDEX_DOM1_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14140, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM1_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x141C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_2[124];
    __IO uint32_t MRC_DOM2_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM2_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM2_RGD_MRC_INDEX_DOM2_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14240, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM2_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x142C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_3[124];
    __IO uint32_t MRC_DOM3_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM3_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM3_RGD_MRC_INDEX_DOM3_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14340, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM3_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x143C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_4[124];
    __IO uint32_t MRC_DOM4_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM4_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM4_RGD_MRC_INDEX_DOM4_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14440, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM4_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x144C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_5[124];
    __IO uint32_t MRC_DOM5_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM5_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM5_RGD_MRC_INDEX_DOM5_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14540, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM5_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x145C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_6[124];
    __IO uint32_t MRC_DOM6_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM6_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM6_RGD_MRC_INDEX_DOM6_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14640, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM6_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x146C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_7[124];
    __IO uint32_t MRC_DOM7_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM7_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM7_RGD_MRC_INDEX_DOM7_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14740, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM7_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x147C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_8[124];
    __IO uint32_t MRC_DOM8_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM8_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM8_RGD_MRC_INDEX_DOM8_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14840, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
