Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_TRDC.h
    __IO uint32_t MRC_DOM8_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x148C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_9[124];
    __IO uint32_t MRC_DOM9_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM9_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM9_RGD_MRC_INDEX_DOM9_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14940, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM9_RGD_NSE;                  /**< MRC Region Descriptor NonSecure Enable, array offset: 0x149C0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_10[124];
    __IO uint32_t MRC_DOM10_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM10_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM10_RGD_MRC_INDEX_DOM10_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14A40, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM10_RGD_NSE;                 /**< MRC Region Descriptor NonSecure Enable, array offset: 0x14AC0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_11[124];
    __IO uint32_t MRC_DOM11_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM11_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM11_RGD_MRC_INDEX_DOM11_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14B40, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM11_RGD_NSE;                 /**< MRC Region Descriptor NonSecure Enable, array offset: 0x14BC0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_12[124];
    __IO uint32_t MRC_DOM12_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM12_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM12_RGD_MRC_INDEX_DOM12_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14C40, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM12_RGD_NSE;                 /**< MRC Region Descriptor NonSecure Enable, array offset: 0x14CC0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_13[124];
    __IO uint32_t MRC_DOM13_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM13_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM13_RGD_MRC_INDEX_DOM13_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14D40, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM13_RGD_NSE;                 /**< MRC Region Descriptor NonSecure Enable, array offset: 0x14DC0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_14[124];
    __IO uint32_t MRC_DOM14_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM14_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM14_RGD_MRC_INDEX_DOM14_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14E40, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM14_RGD_NSE;                 /**< MRC Region Descriptor NonSecure Enable, array offset: 0x14EC0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_15[124];
    __IO uint32_t MRC_DOM15_RGD_W[TRDC_MRC_INDEX_MRC_INDEX_DOM15_RGD_COUNT][TRDC_MRC_INDEX_MRC_INDEX_DOM15_RGD_MRC_INDEX_DOM15_RGD_W_COUNT];   /**< MRC Region Descriptor Word 0..MRC Region Descriptor Word 1, array offset: 0x14F40, array step: index*0x1000, index2*0x8, index3*0x4, irregular array, not all indices are valid */
    __IO uint32_t MRC_DOM15_RGD_NSE;                 /**< MRC Region Descriptor NonSecure Enable, array offset: 0x14FC0, array step: 0x1000, irregular array, not all indices are valid */
         uint8_t RESERVED_16[60];
  } MRC_INDEX[TRDC_MRC_INDEX_COUNT];
} TRDC_Type;

/* ----------------------------------------------------------------------------
   -- TRDC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRDC_Register_Masks TRDC Register Masks
 * @{
 */

/*! @name TRDC_CR - TRDC Register */
/*! @{ */

#define TRDC_TRDC_CR_GVLDM_MASK                  (0x1U)
#define TRDC_TRDC_CR_GVLDM_SHIFT                 (0U)
/*! GVLDM - Global Valid for Domain Assignment Controllers
 *  0b0..TRDC DACs are disabled.
 *  0b1..TRDC DACs are enabled.
 */
#define TRDC_TRDC_CR_GVLDM(x)                    (((uint32_t)(((uint32_t)(x)) << TRDC_TRDC_CR_GVLDM_SHIFT)) & TRDC_TRDC_CR_GVLDM_MASK)

#define TRDC_TRDC_CR_HRL_MASK                    (0x1EU)
#define TRDC_TRDC_CR_HRL_SHIFT                   (1U)
/*! HRL - Hardware Revision Level */
#define TRDC_TRDC_CR_HRL(x)                      (((uint32_t)(((uint32_t)(x)) << TRDC_TRDC_CR_HRL_SHIFT)) & TRDC_TRDC_CR_HRL_MASK)

#define TRDC_TRDC_CR_GVLDB_MASK                  (0x4000U)
#define TRDC_TRDC_CR_GVLDB_SHIFT                 (14U)
/*! GVLDB - Global Valid for Memory Block Checkers
 *  0b0..TRDC MBCs are disabled.
 *  0b1..TRDC MBCs are enabled.
 */
#define TRDC_TRDC_CR_GVLDB(x)                    (((uint32_t)(((uint32_t)(x)) << TRDC_TRDC_CR_GVLDB_SHIFT)) & TRDC_TRDC_CR_GVLDB_MASK)

#define TRDC_TRDC_CR_GVLDR_MASK                  (0x8000U)
#define TRDC_TRDC_CR_GVLDR_SHIFT                 (15U)
/*! GVLDR - Global Valid for Memory Region Checkers
 *  0b0..TRDC MRCs are disabled.
 *  0b1..TRDC MRCs are enabled.
 */
#define TRDC_TRDC_CR_GVLDR(x)                    (((uint32_t)(((uint32_t)(x)) << TRDC_TRDC_CR_GVLDR_SHIFT)) & TRDC_TRDC_CR_GVLDR_MASK)

#define TRDC_TRDC_CR_LK1_MASK                    (0x40000000U)
#define TRDC_TRDC_CR_LK1_SHIFT                   (30U)
/*! LK1 - Lock Status
 *  0b0..The CR can be written by any secure privileged write.
 *  0b1..The CR is locked (read-only) until the next reset.
 */
#define TRDC_TRDC_CR_LK1(x)                      (((uint32_t)(((uint32_t)(x)) << TRDC_TRDC_CR_LK1_SHIFT)) & TRDC_TRDC_CR_LK1_MASK)
/*! @} */

/*! @name TRDC_HWCFG0 - TRDC Hardware Configuration Register 0 */
/*! @{ */

