Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_TRDC.h
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT15_MASK (0x8000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT15_SHIFT (15U)
/*! BIT15 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT15(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT15_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT15_MASK)

#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT16_MASK (0x10000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT16_SHIFT (16U)
/*! BIT16 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT16(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT16_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT16_MASK)

#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT17_MASK (0x20000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT17_SHIFT (17U)
/*! BIT17 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT17(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT17_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT17_MASK)

#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT18_MASK (0x40000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT18_SHIFT (18U)
/*! BIT18 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT18(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT18_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT18_MASK)

#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT19_MASK (0x80000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT19_SHIFT (19U)
/*! BIT19 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT19(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT19_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT19_MASK)

#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT20_MASK (0x100000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT20_SHIFT (20U)
/*! BIT20 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT20(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT20_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT20_MASK)

#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT21_MASK (0x200000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT21_SHIFT (21U)
/*! BIT21 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT21(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT21_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT21_MASK)

#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT22_MASK (0x400000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT22_SHIFT (22U)
/*! BIT22 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT22(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT22_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT22_MASK)

#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT23_MASK (0x800000U)
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT23_SHIFT (23U)
/*! BIT23 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT23(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT23_SHIFT)) & TRDC_MBC_DOM12_MEM2_BLK_NSE_W_BIT23_MASK)

