Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_TRDC.h
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT24_MASK (0x1000000U)
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT24_SHIFT (24U)
/*! BIT24 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT24(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT24_SHIFT)) & TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT24_MASK)

#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT25_MASK (0x2000000U)
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT25_SHIFT (25U)
/*! BIT25 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT25(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT25_SHIFT)) & TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT25_MASK)

#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT26_MASK (0x4000000U)
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT26_SHIFT (26U)
/*! BIT26 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT26(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT26_SHIFT)) & TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT26_MASK)

#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT27_MASK (0x8000000U)
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT27_SHIFT (27U)
/*! BIT27 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT27(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT27_SHIFT)) & TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT27_MASK)

#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT28_MASK (0x10000000U)
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT28_SHIFT (28U)
/*! BIT28 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT28(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT28_SHIFT)) & TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT28_MASK)

#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT29_MASK (0x20000000U)
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT29_SHIFT (29U)
/*! BIT29 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT29(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT29_SHIFT)) & TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT29_MASK)

#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT30_MASK (0x40000000U)
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT30_SHIFT (30U)
/*! BIT30 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT30(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT30_SHIFT)) & TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT30_MASK)

#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT31_MASK (0x80000000U)
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT31_SHIFT (31U)
/*! BIT31 - Bit b NonSecure Enable [b = 0 - 31]
 *  0b0..Secure accesses to block B are based on corresponding MBACSEL field in register
 *       (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]), nonsecure accesses to block B are not allowed.
 *  0b1..Secure accesses to block B are not allowed, nonsecure accesses to block B are based on corresponding
 *       MBACSEL field in register (MBCm_DOMd_MEMs_BLK_CFG_Ww[MBACSEL]).
 */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT31(x)   (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT31_SHIFT)) & TRDC_MBC_DOM14_MEM2_BLK_NSE_W_BIT31_MASK)
/*! @} */

/* The count of TRDC_MBC_DOM14_MEM2_BLK_NSE_W */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_COUNT      (2U)

/* The count of TRDC_MBC_DOM14_MEM2_BLK_NSE_W */
#define TRDC_MBC_DOM14_MEM2_BLK_NSE_W_COUNT2     (1U)

/*! @name MBC_DOM14_MEM3_BLK_CFG_W - MBC Memory Block Configuration Word */
/*! @{ */

#define TRDC_MBC_DOM14_MEM3_BLK_CFG_W_MBACSEL0_MASK (0x7U)
#define TRDC_MBC_DOM14_MEM3_BLK_CFG_W_MBACSEL0_SHIFT (0U)
/*! MBACSEL0 - Memory Block Access Control Select for block B
 *  0b000..select MBC_MEMN_GLBAC0 access control policy for block B
 *  0b001..select MBC_MEMN_GLBAC1 access control policy for block B
 *  0b010..select MBC_MEMN_GLBAC2 access control policy for block B
 *  0b011..select MBC_MEMN_GLBAC3 access control policy for block B
 *  0b100..select MBC_MEMN_GLBAC4 access control policy for block B
 *  0b101..select MBC_MEMN_GLBAC5 access control policy for block B
 *  0b110..select MBC_MEMN_GLBAC6 access control policy for block B
 *  0b111..select MBC_MEMN_GLBAC7 access control policy for block B
 */
#define TRDC_MBC_DOM14_MEM3_BLK_CFG_W_MBACSEL0(x) (((uint32_t)(((uint32_t)(x)) << TRDC_MBC_DOM14_MEM3_BLK_CFG_W_MBACSEL0_SHIFT)) & TRDC_MBC_DOM14_MEM3_BLK_CFG_W_MBACSEL0_MASK)

