Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_TRDC.h
/*! @name MRC_DOM10_RGD_NSE - MRC Region Descriptor NonSecure Enable */
/*! @{ */

#define TRDC_MRC_DOM10_RGD_NSE_BIT0_MASK         (0x1U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT0_SHIFT        (0U)
/*! BIT0 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT0(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT0_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT0_MASK)

#define TRDC_MRC_DOM10_RGD_NSE_BIT1_MASK         (0x2U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT1_SHIFT        (1U)
/*! BIT1 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT1(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT1_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT1_MASK)

#define TRDC_MRC_DOM10_RGD_NSE_BIT2_MASK         (0x4U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT2_SHIFT        (2U)
/*! BIT2 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT2(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT2_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT2_MASK)

#define TRDC_MRC_DOM10_RGD_NSE_BIT3_MASK         (0x8U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT3_SHIFT        (3U)
/*! BIT3 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT3(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT3_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT3_MASK)

#define TRDC_MRC_DOM10_RGD_NSE_BIT4_MASK         (0x10U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT4_SHIFT        (4U)
/*! BIT4 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT4(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT4_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT4_MASK)

#define TRDC_MRC_DOM10_RGD_NSE_BIT5_MASK         (0x20U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT5_SHIFT        (5U)
/*! BIT5 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT5(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT5_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT5_MASK)

#define TRDC_MRC_DOM10_RGD_NSE_BIT6_MASK         (0x40U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT6_SHIFT        (6U)
/*! BIT6 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT6(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT6_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT6_MASK)

#define TRDC_MRC_DOM10_RGD_NSE_BIT7_MASK         (0x80U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT7_SHIFT        (7U)
/*! BIT7 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT7(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT7_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT7_MASK)

#define TRDC_MRC_DOM10_RGD_NSE_BIT8_MASK         (0x100U)
#define TRDC_MRC_DOM10_RGD_NSE_BIT8_SHIFT        (8U)
/*! BIT8 - Bit n NonSecure Enable [n = 0 - 15]
 *  0b0..Secure accesses to region r are based on corresponding MRACSEL field in this register
 *       (MRCm_DOMd_RGDr_Ww[MRACSEL]), nonsecure accesses to region r are not allowed.
 *  0b1..Secure accesses to region r are not allowed, nonsecure accesses to region r are based on corresponding
 *       MRACSEL field in register (MRCm_DOMd_RGDr_Ww[MRACSEL]).
 */
#define TRDC_MRC_DOM10_RGD_NSE_BIT8(x)           (((uint32_t)(((uint32_t)(x)) << TRDC_MRC_DOM10_RGD_NSE_BIT8_SHIFT)) & TRDC_MRC_DOM10_RGD_NSE_BIT8_MASK)

